app/Controllers/BeratBadanController.php

SELECT *
FROM `pasien`
---
    public function form_grafik()
{
    $model = new PasienModel(); // Ganti dengan nama model yang sesuai
    $pasien = $model->findAll(); // Mengambil semua data pasien