app/Controllers/DashboardController.php

    public function index(): string
    {
        $pasienModel = new PasienModel();
        $nakesModel = new NakesModel();
        $beratBadanModel = new BeratBadanModel();

        $data = [
            'jumlahPasien' => $pasienModel->countAll(),
            'jumlahNakes' => $nakesModel->countAll(),
            'dataBeratBadan' => json_encode($beratBadanModel->getBeratBadanData()),
            'usiaKehamilanData' => json_encode($pasienModel->getUsiaKehamilanData())
        ];
---
SELECT COUNT(*) AS `numrows` FROM `pasien`
SELECT COUNT(*) AS `numrows` FROM `nakes`